SimpleTaurusTest/test.yml

scenarios:
  basic:
    requests:
      - http://blazedemo.com/

execution:
  - concurrency: 1
    hold-for: 5s
    ramp-up: 1s
    scenario: basic

settings:
  artifacts-dir: TaurusResult

reporting:
- module: final-stats
  summary: true
  test-duration: true
  dump-xml: TaurusResult/blazeMeterResult.xml

modules:
  console:
    disable: true 
  cloud:
    token: '${BLAZEMETERAPIKEYS}'
    public-report: true
    test: manaliTest
    project: learning-taurus-blaze
    browser-open: start
    check-interval: 10s
    timeout: 10s